app/controllers/songs_controller.rb

  def index
    @songs = params[:artist_id] ? Artist.find(params[:artist_id]) : Song.all
---
SELECT  "artists".* FROM "artists" WHERE (abc) LIMIT 1